package com.yerim.lxp.course.view;

public class CourseOutputView {
	public void printCourseMainMenu() {
		System.out.println("""
			
			============================================================
			                           강의 관리                           
			============================================================
			
			  1. 강의 등록
			  2. 강의 조회
			  3. 뒤로 가기
			
			------------------------------------------------------------
			""");
	}

	public void printCreateCourse() {
		System.out.print("""
			============================================================
			                           강의 등록                           
			============================================================
			
			  강의 정보를 입력하세요.
			
			""");
	}
}
